<template>
  <div class="cgv">
    <van-nav-bar title="CGV影城" fixed placeholder z-index="999" left-arrow @click-left="$router.back()" />
    <div class="box">
      <h4>亲爱的PACONNIE的朋友们,我们真诚的欢迎您使用并体验CGV影城APP/微信小程序的会员卡(以下称为:朋友卡)服务！我们提供两类朋友卡商品供您选择,分别是权益卡及储值卡(实体卡/电子卡);请您在购买前仔细阅读并确认以下内容:</h4>
      <h4>一、通用规则(适用于权益卡及储值卡)</h4>
      <div>1. 适用范围</div>
      <div>适用于全国CGV影城购买影票或指定商品时享受优惠折扣或权益(部分电子权益卡不适用于广州K11影城,详见朋友卡销售详情页)。</div>
      <div>2. 优惠政策</div>
      <div>1)持有效朋友卡在线上(CGV影城官方APP、微信小程序)&线下(影城现场柜台)使用时,可享受相应折扣优惠,具体折扣力度以各影城或销售渠道政策为准;</div>
      <div>2)线上&线下电影票购票优惠上限合计为6张/天/卡;线下购买部分卖品套餐85折,限购3套/天/卡,超出限购数量时,需以所在渠道公示的常规价格(非持卡价格)购买。</div>
      <div>3. 用卡说明</div>
      <div>1)购买成功后,朋友卡将自动绑定至您下单时使用的账户手机号(请至CGV影城APP-我的-朋友卡中查看);</div>
      <div>2)本卡在影城现场使用时,需出示您的朋友卡二维码(请至CGV影城APP-我的-朋友卡中查看),并输入密码进行验证(权益卡密码默认为账户手机号后6位数,储值卡购卡时设定消费密码);在线上渠道使用时,在订单支付页面选择本卡,使用储值卡时需要验证密码(权益卡无需验证密码);</div>
      <div>3)如需变更账户手机号,须由本人携带身份证至影城现场核对信息无误后,可办理变更登记;</div>
      <div>4)凭朋友卡享受相关权益时,部分影城优惠不可与其同享,详见影城活动说明;朋友卡持卡权益详见朋友卡销售页面;</div>
      <div>5)为充分保证您的权益,请勿借予他人使用。</div>
      <div>4. 积分及其他权益</div>
      <div>1)持朋友卡在CGV影城官方线上渠道(APP/微信小程序)购票,可享受1.1倍消费积分;具体消费积分累计及使用规则详见《CGV影城积分规则》;</div>
      <div>2)持朋友卡在CGV影城官方线上渠道(APP/微信小程序)购票,同时可累计亲密值,亲密值增加可提升朋友等级,并获取相应等级朋友权益,具体规则详见《PACONNIE CLUB》相关说明。朋友等级及亲密值可在APP/小程序个人页面查看。</div>
      <h4>二、储值卡使用规则</h4>
      <div>1. 卡有效期</div>
      <div>储值卡内金额及折扣永久有效,但不可提取现金、不产生利息或任何其他收益、不找零、也不具有透支功能。</div>
      <div>2. 开卡手续费</div>
      <div>储值卡开卡时包含开卡手续费:10元/卡(部分明示免年费的营销活动除外);在同一卡内续充值时不再收取开卡手续费。</div>
      <div>3. 年费</div>
      <div>1)储值卡年费:10元/年/卡,开卡/续卡之日起至当年12月31日免收年费;</div>
      <div>2)次年起,每年1月1日至12月31日为年费核算周期,此期间持该储值卡消费满3次(不含退单,影票消费需完成观影,卖品消费需完成取餐),可免除当年年费。</div>
      <div>3)系统将在每年年费核算周期结束后的5个工作日内自动扣除年费,若储值卡内余额不足,则将在此卡充值时补扣。</div>
      <div>4)用户拥有多张储值卡时,年费扣除时将判定每张卡的有效消费次数,不满足年费减免条件的卡均将被扣除年费。</div>
      <div>例:顾客在2021年10月1日购买了一张储值卡,根据年费规则,至2021年12月31日期间免收年费,在2022年1月1日至2022年12月31日期间执行会员储值卡年费收取标准,如消费不满3次,则将在2023年年初扣除10元年费。</div>
      <div>4. 其他规则</div>
      <div>1)如消费时储值卡内余额不足,但余额大于0元时,可在线上渠道订单结算页面或影城线下以其他支付方式补足差价,并享受原有折扣优惠;储值卡余额为0或小于0时,则需续充值后继续享受优惠。</div>
      <div>2)如因主观因素提出退卡时,需将开卡或续卡时所获赠品(如有)一并返还;储值卡退卡时,将收取卡内剩余金额2%作为退卡手续费(低于5元的,按5元收取)。</div>
      <div>3)储值卡不支持线上退卡,如有需要请联系CGV影城官方APP/微信公众号/微信小程序线上客服,或拨打客服电话400-718-5575。</div>
      <h4>三、权益卡使用规则</h4>
      <div>1. 卡有效期</div>
      <div>权益卡(线下_全优卡:影城现场销售;线上_E优卡:APP及微信小程序)为一次性购买商品,设有使用有效期;所有权益到期自动失效。各权益卡有效期为:季度卡(3个自然月)、半年卡(6个自然月)、一年卡(12个自然月)、两年卡(24个自然月);</div>
      <div>有效期计算方式:</div>
      <div>1)选择立即办卡/赠送好友时,有效期自开卡之日起计算。</div>
      <div>2)选择立即续卡时,可选择其中一张进行延期,有效期自动累积(部分活动类权益卡无法进行延期续卡,具体续卡规则请以活动公示为准)。</div>
      <div>2. 其他规则</div>
      <div>1)权益卡卡费为权益费,无充值功能,不得折抵现金使用。</div>
      <div>2)权益卡一经售出,不予退换。</div>
    </div>
  </div>
</template>

<style lang="scss">
.cgv {
  .box {
    padding: 0 10px 10px;
    font-size: 12px;
    line-height: 18px;
    h4 {
      margin-bottom: 0;
    }
    h4:nth-of-type(1) {
      margin: 0;
    }
    div {
      color: #333;
    }
  }
}
</style>