<template>
  <div class="gkxz">
    <van-nav-bar title="顾客须知" fixed placeholder z-index="999" :border="false" left-arrow @click-left="$router.back()" />
    <div class="box">
      <h5>顾客须知</h5>
      <h5>1、点餐&取餐</h5>
      <div>选择您的餐品和份数,加入[购物车点击[选好了]进入取餐方式确认后进入支付页面。输入并确认您的[手机号],可在取货处通过取餐号来领取您的餐品。</div>
      <h5>2、支付</h5>
      <div>目前自助点单,支持[微信支付]及支付宝支付],支付前请再次检查您的手机号码、订单金额、订单内容等信息无误后,点击支付,支付完成后,您的订单将自动提交,页面出现订单提交成功提示。</div>
      <h5>点餐须知</h5>
      <div>1、本服务仅接受当天订货及取货,必须支付完成后再取餐。</div>
      <div>2、支付成功后将显示取餐排号,请至取餐区出示取餐排号。根据您实际完成支付的时间,您指定的取餐时间可能顺延。</div>
      <div>3、本服务营业时间为10:00-22:30(根据各影城实际情况有所不同)。</div>
      <div>4、如有问题请联系现场工作人员。</div>
      <h5>常见问题</h5>
      <div>1、怎么修改订单?</div>
      <div>自助点单不提供修改订单功能,请在支付前仔细核对订单内容。</div>
      <h5>2、支付后的订单可以退款和取消吗?</h5>
      <div>支付完成后不能进行退款和取消,请在支付前仔细核对订单内容。</div>
      <h5>3、临时有事,无法按时去餐?</h5>
      <div>所有已进入配餐等候的订单,均无法取消且不能退款,请及时领取您的餐品。</div>
      <h5>4、如何查我的订单状态?</h5>
      <div>点击MYCG在“我的订单”中查询订单状态。</div>
      <h5>5、周边商品怎么领取?</h5>
      <div>请在购买后,到购买店领取,前台工作人员将会准备好您的商品。</div>
    </div>
  </div>
</template>

<style lang="scss">
.gkxz {
  .box {
    padding: 0 10px 10px;
    line-height: 18px;
    h5 {
      font-size: 12px;
      margin-bottom: 0;
    }
    h5:nth-of-type(1) {
      margin: 0;
    }
    div {
      font-size: 12px;
      color: #333;
    }
  }
}
</style>