<template>
  <div class="jfgz">
    <van-nav-bar title="积分规则" fixed placeholder z-index="999" left-arrow @click-left="$router.back()" />
    <div class="box">
      <h5>消费积分获取规则</h5>
      <div>1、成功购买影票或卖品时,以订单实际支付金额的20%累计积分。(即消费100元可累计20积分)。</div>
      <div>2、以下情形无积分奖励:</div>
      <div>-在第三方渠道(淘票票、猫眼等)产生的,或其他未验证会员信息的消费不积分;</div>
      <div>-购买及使礼品卡/兑换券(如团体票/APP套票等)不积分;</div>
      <div>-购买朋友卡(全优卡/储值卡等)的卡费金额及充值金额不累计消费积分(使用时按照消费积分规则累计积分);</div>
      <div>3、消费积分将在订单完成后(观影结束或卖品交易完成后)次日到账；如订单被取消,则该订单对应的消费积分也将被取消。</div>
      <div>4、消费积分有效期自生效日起至次年12月31日为止,逾期失效。</div>
      <div>5、消费积分获取上限:单日获取上限为100积分,且单日最多为12张电影票可获取积分(按下单顺序的前12张电影票)。</div>
      <h5> 积分使用方式</h5>
      <div>1、注册成功时可获得5积分(即初心朋友升级礼);</div>
      <div>2、首次下载官方APP可获得5积分;</div>
      <div> 3、当您的个人资料完善度100%时,可最多获得5积分(仅限CGV影城官方APP/小程序渠道);</div>
      <div> 4、购买指定全优卡及E优卡可得积分(开卡礼遇),详见活动规则;</div>
      <div> 5、高等级朋友及持卡朋友消费时,可得额外活动积分,详见《Paconnie Club》活动规则;</div>
      <div>6、积分商城中积分游戏奖励,详见活动规则;</div>
      <div>7、参与其他积分赠送活动时,根据活动规则,可获得相应赠送的积分;</div>
      <div>8、活动积分有效期各不相同,详见活动规则。</div>
      <h5>积分使用方法</h5>
      <div>1、可在积分商城使用:-用于积分商城中兑换礼券、商品或参与积分游戏;</div>
      <div> 2、可在订单支付页面快捷兑换立减券:-体内容详见页面说明。</div>

    </div>
  </div>
</template>

<style lang="scss">
.jfgz {
  .box {
    padding: 0 10px;
    line-height: 20px;
    h5 {
      margin: 20px 0 10px;
    }
    div {
      font-size: 12px;
      color: #aaa;
    }
  }
}
</style>